# –î–æ–º–∞—à–Ω—î –∑–∞–≤–¥–∞–Ω–Ω—è –¥–æ —Ç–µ–º apply(), groupby(), pivot_table()

–í —Ü—å–æ–º—É –¥–æ–º–∞—à–Ω—å–æ–º—É –∑–∞–≤–¥–∞–Ω–Ω—ñ –ø—Ä–æ–¥–æ–≤–∂—É—î–º–æ –ø—Ä–∞—Ü—é–≤–∞—Ç–∏ –∑ –Ω–∞–±–æ—Ä–æ–º –¥–∞–Ω–∏—Ö `supermarket_sales.csv`.

0. –Ü–º–ø–æ—Ä—Ç—É–π—Ç–µ –±—ñ–±–ª—ñ–æ—Ç–µ–∫—É pandas —Ç–∞ –∑—á–∏—Ç–∞–π—Ç–µ –¥–∞–Ω—ñ —É –∑–º—ñ–Ω–Ω—É `df` —Ç–∏–ø—É `pandas.DataFrame`.

In [1]:
import pandas as pd
df = pd.read_csv('supermarket_sales.csv')

1. –î–æ—Å–ª—ñ–¥–∏–º–æ, —è–∫–∏–π —Ñ—ñ–ª—ñ–∞–ª —Å—É–ø–µ—Ä–º–∞—Ä–∫–µ—Ç—É ('Branch') —î –Ω–∞–π–ø—Ä–∏–±—É—Ç–∫–æ–≤—ñ—à–∏–º. –î–ª—è —Ü—å–æ–≥–æ –∑–Ω–∞–π–¥—ñ—Ç—å —Å—É–º–∞—Ä–Ω–∏–π –ø—Ä–∏–±—É—Ç–æ–∫ –∑–∞ –∫–æ–∂–Ω–∏–º —Ñ—ñ–ª—ñ–∞–ª–æ–º —ñ –≤–∏—è–≤—ñ—Ç—å, —è–∫–∏–π —Ñ—ñ–ª—ñ–∞–ª –º–∞—î –Ω–∞–π–≤–∏—â–∏–π.

In [3]:
df.groupby('Branch')['gross income'].sum()

Branch
A    5057.1605
B    5057.0320
C    5265.1765
Name: gross income, dtype: float64

**–§—ñ–ª—ñ–∞–ª –° –Ω–∞–π–ø—Ä–∏–±—É—Ç–∫–æ–≤—ñ—à–∏–π**

2. –í —è–∫–æ–º—É –º—ñ—Å—Ç—ñ –∑–Ω–∞–π—Ö–æ–¥–∏—Ç—å—Å—è —Ñ—ñ–ª—ñ–∞–ª –∑ –Ω–∞–π–≤–∏—â–∏–º –ø—Ä–∏–±—É—Ç–∫–æ–º? –ú–æ–∂–µ –≤ —Ç–æ–º—É –º—ñ—Å—Ü—ñ –Ω–∞–º —Ä–æ–∑–º—ñ—Ç–∏—Å—Ç–∏ —â–µ –æ–¥–∏–Ω –º–∞–≥–∞–∑–∏–Ω.  
–ó–Ω–∞–π–¥—ñ—Ç—å –≤—ñ–¥–ø–æ–≤—ñ–¥—å –∑–∞ –¥–æ–ø–æ–º–æ–≥–æ—é —Ñ—É–Ω–∫—Ü—ñ–æ–Ω–∞–ª—É Pandas.

In [5]:
df.groupby('City').agg({'gross income': 'sum', 'Total': 'mean', 'Invoice ID': 'count', 'Unit price':'mean'})

           gross income       Total  Invoice ID  Unit price
City
Mandalay      5057.0320  319.872506         332   55.659277
Naypyitaw     5265.1765  337.099715         328   56.609024
Yangon        5057.1605  312.354031         340   54.780853

**–£ –º—ñ—Å—Ç—ñ Naypyitaw –∑–Ω–∞—Ö–æ–¥–∏—Ç—å—Å—è —Ñ—ñ–ª—ñ–∞–ª –∑ –Ω–∞–π–≤–∏—â–∏–º –ø—Ä–∏–±—É—Ç–∫–æ–º. –£ —Ü—å–æ–º—É –º—ñ—Å—Ç—ñ —Ç–∞–∫–æ–∂ –∑–∞—Ñ—ñ–∫—Å–æ–≤–∞–Ω–æ –Ω–∞–π–≤–∏—â—É —Å–µ—Ä–µ–¥–Ω—é —Ü—ñ–Ω—É —Ç–æ–≤–∞—Ä—É —Ç–∞ –Ω–∞–π–º–µ–Ω—à—É –∫—ñ–ª—å–∫—ñ—Å—Ç—å –ø–æ–∫—É–ø–æ–∫, —â–æ –ø—Ä–∏–∑–≤–æ–¥–∏—Ç—å –¥–æ –≤–∏—Å–æ–∫–æ–≥–æ —Å–µ—Ä–µ–¥–Ω—å–æ–≥–æ —á–µ–∫—É.**

3.1. –°—Ç–≤–æ—Ä—ñ—Ç—å –∑–≤–æ–¥–Ω—É —Ç–∞–±–ª–∏—Ü—é, —è–∫–∞ –ø–æ–∫–∞–∂–µ, —Å–∫—ñ–ª—å–∫–∏ –ø–æ–∫—É–ø–æ–∫ (—ñ–Ω–≤–æ–π—Å—ñ–≤) –±—É–ª–æ –∑—Ä–æ–±–ª–µ–Ω–æ –≤ –∫–æ–∂–Ω—ñ–π –∑ —Ñ—ñ–ª—ñ–π (`Branch`) –∑–∞ —Ä—ñ–∑–Ω–∏–º–∏ –∫–∞—Ç–µ–≥–æ—Ä—ñ—è–º–∏ —Ç–æ–≤–∞—Ä—ñ–≤. –ó–∞–ø–∏—à—ñ—Ç—å —Ç–∞–±–ª–∏—Ü—é –≤ –∑–º—ñ–Ω–Ω—É `invoices_by_category` —ñ –≤–∏–≤–µ–¥—ñ—Ç—å –∑–º—ñ–Ω–Ω—É –Ω–∞ –µ–∫—Ä–∞–Ω.
–¶—è —Ç–∞–±–ª–∏—Ü—è –¥–æ–ø–æ–º–æ–∂–µ –ø—Ä–æ–∞–Ω–∞–ª—ñ–∑—É–≤–∞—Ç–∏, –≤ —è–∫—ñ–π —Ñ—ñ–ª—ñ—ó –∫—É–ø—É—é—Ç—å –Ω–∞–π–±—ñ–ª—å—à–µ —Ç–æ–≤–∞—Ä—ñ–≤ –∫–æ–∂–Ω–æ—ó –∑ –∫–∞—Ç–µ–≥–æ—Ä—ñ–π.

In [7]:
invoices_by_category = pd.pivot_table(df, index='Branch', columns='Product line', values='Invoice ID', aggfunc='count')
invoices_by_category

Product line,Electronic accessories,Fashion accessories,Food and beverages,Health and beauty,Home and lifestyle,Sports and travel
Branch,,,,,,
A,60,51,58,47,65,59
B,55,62,50,53,50,62
C,55,65,66,52,45,45

–û—á—ñ–∫—É–≤–∞–Ω–∏–π —Ä–µ–∑—É–ª—å—Ç–∞—Ç:

![](https://drive.google.com/uc?export=view&id=1rueAdko6S3UxIHGtojetTxlES-EyM6Yb)

3.2. –í–∏–∫—Ä–∏—Å—Ç–æ–≤—É—é—á–∏ –∑–º—ñ–Ω–Ω—É `invoices_by_category` –¥–∞–π—Ç–µ –≤—ñ–¥–ø–æ–≤—ñ–¥—å –ø—Ä–æ–≥—Ä–∞–º–Ω–æ (—Ç–æ–±—Ç–æ –∑–Ω–∞—á–µ–Ω–Ω—è —Ç—Ä–µ–±–∞ –Ω–µ –ø—Ä–æ—Å—Ç–æ –∑–Ω–∞–π—Ç–∏ –æ—á–∏–º–∞, –∞ –≤–∏–≤–µ—Å—Ç–∏ –∑–∞ –¥–æ–ø–æ–º–æ–≥–æ—é –∫–æ–¥—É), –≤ —è–∫–æ–º—É —Ñ—ñ–ª—ñ–∞–ª—ñ –º–∞–≥–∞–∑–∏–Ω—É (`Branch`) –Ω–∞–π–±—ñ–ª—å—à–µ —ñ–Ω–≤–æ–π—Å—ñ–≤ —ñ–∑ –ø–æ–∫—É–ø–∫–æ—é —Ç–æ–≤–∞—Ä—ñ–≤ –∫–∞—Ç–µ–≥–æ—Ä—ñ—ó "–ï–ª–µ–∫—Ç—Ä–æ–Ω–Ω—ñ –∞–∫—Å–µ—Å—É–∞—Ä–∏" (`Electronic accessories`)?

In [9]:
invoices_by_category.sort_values(by='Electronic accessories', ascending=False)

Product line,Electronic accessories,Fashion accessories,Food and beverages,Health and beauty,Home and lifestyle,Sports and travel
Branch,,,,,,
A,60,51,58,47,65,59
B,55,62,50,53,50,62
C,55,65,66,52,45,45

4-6. **–¢–≤–æ—Ä—á–µ –∑–∞–≤–¥–∞–Ω–Ω—è –Ω–∞ —Ä–æ–∑–≤–∏—Ç–æ–∫ –∞–Ω–∞–ª—ñ—Ç–∏—á–Ω–æ–≥–æ –º–∏—Å–ª–µ–Ω–Ω—è**

–ö—Ä–æ–∫ 1. –°—Ñ–æ—Ä–º—É–ª—é–π—Ç–µ –¢–†–ò –ø–∏—Ç–∞–Ω–Ω—è (–≥—ñ–ø–æ—Ç–µ–∑–∏) –¥–æ –Ω–∞—è–≤–Ω–∏—Ö –¥–∞–Ω–∏—Ö, —è–∫—ñ –¥–æ–ø–æ–º–æ–≥–ª–∏ –± –≤–∞–º –∑—Ä–æ–∑—É–º—ñ—Ç–∏, —è–∫—ñ –∫–æ—Ä–∏—Å—Ç—É–≤–∞—á—ñ —â–æ, –¥–µ —Ç–∞ –∫–æ–ª–∏ –Ω–∞–π–±—ñ–ª—å—à–µ/–Ω–∞–π–º–µ–Ω—à–µ –∫—É–ø—É—é—Ç—å, –∞–±–∏ –¥–∞—Ç–∏ –Ω–∞ –æ—Å–Ω–æ–≤—ñ —Ü–∏—Ö –≥—ñ–ø–æ—Ç–µ–∑ —Ä–µ–∫–æ–º–µ–Ω–¥–∞—Ü—ñ—ó –±—ñ–∑–Ω–µ—Å—É. –ó–≤—ñ—Å–Ω–æ –ø–∏—Ç–∞–Ω–Ω—è –º–∞—é—Ç—å –±—É—Ç–∏ –Ω–µ —Ç–∏–º–∏, –Ω–∞ —è–∫—ñ –º–∏ –≤–∂–µ –≤—ñ–¥–ø–æ–≤—ñ–ª–∏ –≤ –∑–∞–≤–¥–∞–Ω–Ω—è—Ö –º–æ–¥—É–ª—é.

–ö—Ä–æ–∫ 2. –ó–Ω–∞–π–¥—ñ—Ç—å –≤—ñ–¥–ø–æ–≤—ñ–¥—ñ –Ω–∞ —Å–≤–æ—ó –ø–∏—Ç–∞–Ω–Ω—è –∑ –¥–æ–ø–æ–º–æ–≥–æ—é —Ñ—É–Ω–∫—Ü—ñ–æ–Ω–∞–ª—É pandas.

–ö—Ä–æ–∫ 3. –ù–∞–ø–∏—à—ñ—Ç—å, —è–∫ –≤—ñ–¥–ø–æ–≤—ñ–¥—å –Ω–∞ —Ü–µ –ø–∏—Ç–∞–Ω–Ω—è –º–æ–∂–µ –±—É—Ç–∏ –≤–∏–∫–æ—Ä–∏—Å—Ç–∞–Ω–∞ –¥–ª—è –ø—Ä–∏–π–Ω—è—Ç—Ç—è –±—ñ–∑–Ω–µ—Å —Ä—ñ—à–µ–Ω—å.   
   
 –ü–∏—Ç–∞–Ω–Ω—è –º–æ–∂—É—Ç—å –±—É—Ç–∏ –±—É–¥—å-—è–∫–æ—ó —Å–∫–ª–∞–¥–Ω–æ—Å—Ç—ñ, –∞–ª–µ —ó—Ö –º–∞—î –±—É—Ç–∏ 3. –ö–æ–∂–Ω–µ –ø–∏—Ç–∞–Ω–Ω—è –æ—Ü—ñ–Ω—é—î—Ç—å—Å—è —è–∫ 1 –∑–∞–≤–¥–∞–Ω–Ω—è. –ë–µ–∑ –≤–∏–∫–æ–Ω–∞–Ω–Ω—è —Ü—å–æ–≥–æ –∑–∞–≤–¥–∞–Ω–Ω—è –î–ó –Ω–µ –ø—Ä–∏–π–º–∞—î—Ç—å—Å—è. –Ø–∫—â–æ —î –ø–∏—Ç–∞–Ω–Ω—è —â–æ–¥–æ –≤–∏–∫–æ–Ω–∞–Ω–Ω—è - –ø–∏—à—ñ—Ç—å —É —á–∞—Ç üôå

–ó –¥–∞–Ω–∏—Ö –ø–æ–ø–µ—Ä–µ–¥–Ω—å–æ–≥–æ –∞–Ω–∞–ª—ñ–∑—É –º–∏ –±–∞—á–∏–º–æ —â–æ –Ω–∞–π–±—ñ–ª—å—à—ñ –ø—Ä–∏–±—É—Ç–∫–∏ —î –≤ –º—ñ—Å—Ç—ñ Naypyitaw.
1. –£ –º—ñ—Å—Ç—ñ Naypyitaw (—è–∫ —ñ –∑–∞–≥–∞–ª–æ–º) –Ω–∞–π–±—ñ–ª—å—à–∏–π –¥–æ—Ö—ñ–¥ –ø—Ä–∏–Ω–æ—Å–∏—Ç—å –ª—ñ–Ω—ñ–π–∫–∞ —Ç–æ–≤–∞—Ä—ñ–≤ Food and beverages. –£ —ñ–Ω—à–∏—Ö –º—ñ—Å—Ç–∞—Ö –¥–æ—Ö—ñ–¥ –≤—ñ–¥ —Ü—ñ—î—ó –≥—Ä—É–ø–∏ –∑–Ω–∞—á–Ω–æ –Ω–∏–∂—á–∏–π. –†–µ–∫–æ–º–µ–Ω–¥—É—î—Ç—å—Å—è –ø—Ä–æ–≤–µ—Å—Ç–∏ –¥–µ—Ç–∞–ª—å–Ω–∏–π –∞–Ω–∞–ª—ñ–∑ –∞—Å–æ—Ä—Ç–∏–º–µ–Ω—Ç—É —Ü—ñ—î—ó –≥—Ä—É–ø–∏ –≤ —Ä—ñ–∑–Ω–∏—Ö –º—ñ—Å—Ç–∞—Ö.
2. –ù–∞–π–±—ñ–ª—å—à–µ –ø–æ–∫—É–ø—Ü—ñ–≤ —É –≤—Å—ñ–π –º–µ—Ä–µ–∂—ñ —Ç–∞ –≤ Naypyitaw –≤–∏–∫–æ—Ä–∏—Å—Ç–æ–≤—É—î –≥–æ—Ç—ñ–≤–∫–æ–≤—É –æ–ø–ª–∞—Ç—É, —Ç–æ–¥—ñ —è–∫ –µ–ª–µ–∫—Ç—Ä–æ–Ω–Ω–∏–º –≥–∞–º–∞–Ω—Ü–µ–º –ø–µ—Ä–µ–≤–∞–∂–Ω–æ —Ä–æ–∑—Ä–∞—Ö–æ–≤—É—é—Ç—å—Å—è —É Yangon. –†–µ–∫–æ–º–µ–Ω–¥—É—î—Ç—å—Å—è –ø—Ä–æ–∞–Ω–∞–ª—ñ–∑—É–≤–∞—Ç–∏ –≤–∏—Ç—Ä–∞—Ç–∏ –Ω–∞ —Ä—ñ–∑–Ω—ñ —Å–ø–æ—Å–æ–±–∏ –æ–ø–ª–∞—Ç–∏, —â–æ–± –≤–∏–∑–Ω–∞—á–∏—Ç–∏ –Ω–∞–π–º–µ–Ω—à –∑–∞—Ç—Ä–∞—Ç–Ω–∏–π –¥–ª—è –æ—Ä–≥–∞–Ω—ñ–∑–∞—Ü—ñ—ó.
3. –ó–∞–≥–∞–ª–æ–º –±—ñ–ª—å—à–µ –ø–æ–∫—É–ø–æ–∫ –∑–¥—ñ–π—Å–Ω—é—é—Ç—å –∂—ñ–Ω–∫–∏, –æ—Å–æ–±–ª–∏–≤–æ —É –≥—Ä—É–ø—ñ Food and beverages, —Ç–æ–¥—ñ —è–∫ —á–æ–ª–æ–≤—ñ–∫–∏ –ø–µ—Ä–µ–≤–∞–∂–∞—é—Ç—å —É –≥—Ä—É–ø—ñ Health and beauty. –ó–∞ –º—ñ—Å—Ç–∞–º–∏: —É Naypyitaw –±—ñ–ª—å—à–µ –ø–æ–∫—É–ø—Ü—ñ–≤ ‚Äî –∂—ñ–Ω–∫–∏, –∞ —É Mandalay ‚Äî —á–æ–ª–æ–≤—ñ–∫–∏. –†–µ–∫–æ–º–µ–Ω–¥—É—î—Ç—å—Å—è –∑–≤–µ—Ä–Ω—É—Ç–∏—Å—è –¥–æ –¥–æ–¥–∞—Ç–∫–æ–≤–∏—Ö –¥–∂–µ—Ä–µ–ª, —â–æ–± –ø—Ä–æ–∞–Ω–∞–ª—ñ–∑—É–≤–∞—Ç–∏ –¥–µ–º–æ–≥—Ä–∞—Ñ—ñ—á–Ω—ñ –¥–∞–Ω—ñ –Ω–∞—Å–µ–ª–µ–Ω–Ω—è —Ü–∏—Ö –º—ñ—Å—Ç.

In [11]:
pd.pivot_table(df, index='Product line', columns='City', values='gross income', aggfunc='sum').sort_values(by='Naypyitaw', ascending=False)

City                    Mandalay  Naypyitaw     Yangon
Product line
Food and beverages      724.5185  1131.7550   817.2905
Fashion accessories     781.5865  1026.6700   777.7385
Electronic accessories  811.9735   903.2845   872.2435
Health and beauty       951.4600   791.2060   599.8930
Sports and travel       951.8190   750.5680   922.5095
Home and lifestyle      835.6745   661.6930  1067.4855

In [13]:
df.groupby('Product line')['gross income'].sum().sort_values(ascending=False)

Product line
Food and beverages        2673.5640
Sports and travel         2624.8965
Electronic accessories    2587.5015
Fashion accessories       2585.9950
Home and lifestyle        2564.8530
Health and beauty         2342.5590
Name: gross income, dtype: float64

In [15]:
df.groupby('Payment').agg({'gross income': 'sum', 'Invoice ID': 'count'}).sort_values(by='gross income', ascending=False)

             gross income  Invoice ID
Payment
Cash             5343.170         344
Ewallet          5237.767         345
Credit card      4798.432         311

In [17]:
pd.pivot_table(df, index=['City'], columns='Payment', values='gross income', aggfunc='sum').sort_values(by='Cash', ascending=False)

Payment         Cash  Credit card   Ewallet
City
Naypyitaw  2051.7075    1444.1650  1769.304
Mandalay   1682.8315    1778.3265  1595.874
Yangon     1608.6310    1575.9405  1872.589

In [19]:
df.groupby('Gender')['gross income'].sum().sort_values(ascending=False)

Gender
Female    7994.425
Male      7384.944
Name: gross income, dtype: float64

In [21]:
pd.pivot_table(df, index=['Product line'], columns='Gender', values='gross income', aggfunc='sum').sort_values(by='Female', ascending=False)

Gender                     Female       Male
Product line
Food and beverages      1579.5675  1093.9965
Fashion accessories     1449.4000  1136.5950
Home and lifestyle      1430.3275  1134.5255
Sports and travel       1360.7010  1264.1955
Electronic accessories  1290.5725  1296.9290
Health and beauty        883.8565  1458.7025

In [23]:
pd.pivot_table(df, index=['City'], columns='Gender', values='gross income', aggfunc='sum').sort_values(by='Female', ascending=False)

Gender       Female       Male
City
Naypyitaw  2937.403  2327.7735
Yangon     2536.627  2520.5335
Mandalay   2520.395  2536.6370